{
  "backend/main.mo": "Main Motoko actor defining user profile storage and annotation CRUD/sync endpoints, with access control checks on all calls and migration support via Migration.run.",
  "backend/migration.mo": "Migration module that defines old and new actor state shapes and provides a run function to migrate from the legacy multi-collection state to the simplified currentUserProfiles map.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their IDs, titles, associated files, components, test IDs, and confidence levels, focused on PDF upload/assignment and admin panel flows.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for component responsibilities and hook exports.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark color themes including primary, secondary, accent, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the SmartBoard Faculty PDF Portal PWA, referencing the manifest, PWA icons, and the main React entry script.",
  "frontend/public/manifest.json": "PWA manifest for EduBoard defining app name, icons, display mode (standalone landscape), theme colors, and categories for education/productivity.",
  "frontend/public/service-worker.js": "Service worker implementing install/activate cache management and a fetch strategy: network-first for navigation and ICP API calls, cache-first for static assets.",
  "frontend/src/App.tsx": "Root React app using TanStack Router with routes for home, admin, faculty portal, teaching view, and developer portal; wraps the app in ErrorBoundary, FacultyProvider, and a device registration gate.",
  "frontend/src/components/AdminPasscodeGate.tsx": "A gate component that wraps admin content behind a username/password login form, persisting authentication state in sessionStorage and supporting a lock event to force logout.",
  "frontend/src/components/AnnotationCanvas.tsx": "A canvas component that renders and handles interactive drawing annotations (freehand, shapes, text, eraser, images) on top of PDF pages, exposing a ref for clearing pages.",
  "frontend/src/components/AnnotationToolbar.tsx": "A toolbar component providing controls for selecting annotation tools (draw, highlight, shapes, text, eraser, image), adjusting stroke size and color, navigating pages, and marking content as taught.",
  "frontend/src/components/ChangeAdminCredentialsForm.tsx": "A form component that allows updating admin login credentials (username and password) with validation and success/error feedback.",
  "frontend/src/components/CreateFacultyModal.tsx": "A modal dialog for creating a new faculty member by entering their name, with form validation and mutation-based submission.",
  "frontend/src/components/DeviceLimitBlocker.tsx": "A full-screen overlay component that blocks access when the device license limit (10 devices) has been reached, displaying an error message and contact instructions.",
  "frontend/src/components/DeviceManagementSection.tsx": "Displays a card UI for managing registered devices, showing usage progress, a table of device fingerprints, and allowing removal of individual devices with a confirmation dialog. Uses React Query hooks for data fetching and mutation.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches unhandled errors and renders a full-screen fallback UI with the error message and a reload button.",
  "frontend/src/components/FacultyManagementTable.tsx": "Renders a table of faculty members with per-row inline name editing, active/inactive toggling, and deletion, using React Query mutations for each operation.",
  "frontend/src/components/FacultyPDFList.tsx": "Fetches and displays a list of PDFs assigned to a specific faculty member as clickable cards, each showing taught/not-taught status and navigating to the teach route on click.",
  "frontend/src/components/FacultySelector.tsx": "Renders a dropdown selector for faculty members with a continue button, calling an onSelect callback with the chosen faculty's id and name.",
  "frontend/src/components/Layout.tsx": "Provides the app shell with a sticky header (logo, navigation buttons, admin lock button), a main content area, and a footer with branding and a caffeine.ai attribution link.",
  "frontend/src/components/PDFListTable.tsx": "Renders a table of uploaded PDFs showing title, assigned faculty names, upload date, and taught/untaught status. Displays an empty state when no PDFs exist.",
  "frontend/src/components/PDFUploadForm.tsx": "Form component for uploading a PDF with a title and faculty assignment, reading the file as base64 and submitting via the useUploadPDF mutation. Includes validation and error display.",
  "frontend/src/components/SubscriptionSection.tsx": "Displays Basic, Premium, and Diamond subscription plan cards with per-plan billing cycle selectors and pricing, persisting the active plan selection to localStorage.",
  "frontend/src/context/FacultyContext.tsx": "React context that stores and exposes the currently selected faculty member's ID and name, with set and clear helpers.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useDeviceRegistration.ts": "Hook that manages device registration status against the backend actor, with a 12-second safety timeout that falls back to 'allowed' if registration stalls. Currently bypasses the backend call and allows access immediately.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, wrapping DFINITY's AuthClient to expose login, logout, identity, and login-status state to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines data types, plan tier constants, localStorage helpers, and React Query hooks for managing faculty, PDFs, devices, and annotations in the EduBoard frontend.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind, and defines CSS custom properties for light/dark theme color tokens plus utility classes for touch targets and annotation canvas.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page protected by a passcode gate, providing UI sections for faculty management, PDF upload/listing, subscription, device management, and admin credential changes.",
  "frontend/src/pages/DeveloperPortal.tsx": "Developer portal page displaying tabbed views of faculty, PDFs, and devices with stats cards, progress indicators, and refresh controls sourced from React Query hooks.",
  "frontend/src/pages/FacultyPortal.tsx": "Faculty portal page that shows a faculty selector when no faculty is chosen, then displays that faculty's PDF list with a sticky header for switching faculty or navigating to the dev portal.",
  "frontend/src/pages/HomePage.tsx": "Landing page with a hero section, feature highlights, and navigation buttons to the Admin Panel and Faculty Portal, plus a notice showing default admin credentials.",
  "frontend/src/pages/TeachingView.tsx": "Full-screen teaching view page that loads PDF annotations, provides annotation tools (draw, highlight, text), auto-saves strokes to the backend with debouncing, and allows faculty to mark a PDF as taught.",
  "frontend/src/utils/deviceFingerprint.ts": "Generates and caches a stable device fingerprint by combining browser/device characteristics (user agent, screen, canvas hash) with a persisted UUID stored in localStorage.",
  "frontend/src/utils/pwa.ts": "Provides a React hook for PWA install prompt handling and a utility function to register the service worker for offline/installable app support.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with helpers to persist, retrieve, and clear parameters via sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system: custom color tokens using OKLCH variables, typography/container-queries/animate plugins, extended font families, border radii, shadows, and font sizes for smart-board legibility.",
  "project_state.json": "Project state manifest (version 45) describing the smart board app's features, architecture, known bugs (blank page, faculty creation failures, double-auth, PDF assignment issues), and fix-request context."
}