{
  "backend/main.mo": "Main Motoko actor defining data types (Faculty, PDF, Annotation) and CRUD operations for a faculty PDF portal, with role-based access control, admin credential management, and query/update methods for managing faculty, PDFs, annotations, and user profiles.",
  "backend/migration.mo": "Migration module that upgrades the actor state from OldActor to NewActor by injecting default admin credentials (username: admin, password: admin1234) into the persisted state.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their IDs, titles, affected files, component dependencies, and test IDs—covering admin credential login, change-credentials form, and related UI updates.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, serving as a reference index for the frontend codebase structure and component responsibilities.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, including color tokens for background, foreground, primary, accent, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app, setting up PWA metadata (manifest, apple-touch-icon, theme color) and mounting the root React component via main.tsx.",
  "frontend/public/manifest.json": "PWA manifest for EduBoard defining app name, icons, display mode (standalone), landscape orientation, and theme/background colors for installation on devices.",
  "frontend/public/service-worker.js": "Service worker implementing a network-first strategy for navigation and ICP API calls, and a cache-first strategy for static assets, with cache versioning and cleanup on activation.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for home, admin, faculty portal, teaching view, and developer portal, wrapped in a device registration gate and error boundary.",
  "frontend/src/components/AdminPasscodeGate.tsx": "A gate component that renders a login form requiring admin username/password credentials before displaying its children, storing authentication state in sessionStorage and supporting a lock event to reset it.",
  "frontend/src/components/AnnotationCanvas.tsx": "A canvas component that handles drawing, highlighting, shapes, text, eraser, and image annotation tools on a per-page basis, rendering both saved and in-progress strokes via the Canvas 2D API.",
  "frontend/src/components/AnnotationToolbar.tsx": "A toolbar component providing controls for selecting annotation tools (draw, highlight, text, eraser, shapes, image), adjusting stroke/fill color and size, navigating pages, and marking content as taught.",
  "frontend/src/components/ChangeAdminCredentialsForm.tsx": "A form component that allows updating the admin username and password, with client-side validation (min length, match check) and success/error feedback via the useSetAdminCredentials mutation hook.",
  "frontend/src/components/CreateFacultyModal.tsx": "A dialog modal for creating a new faculty member by name, with structured backend error parsing (limit reached, duplicates, auth errors) and state reset on open/close via the useAddFaculty mutation hook.",
  "frontend/src/components/DeviceLimitBlocker.tsx": "A full-screen overlay component that blocks app access when the device license limit (10 devices) has been reached, displaying an informational message and contact instructions.",
  "frontend/src/components/DeviceManagementSection.tsx": "Displays a card UI for managing registered devices tied to a license, showing usage progress and a table of devices with the ability to remove individual entries. Uses hooks for fetching device data and enforces a 10-device limit with visual warnings.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches unhandled render errors and displays a full-screen fallback UI with the error message and a reload button.",
  "frontend/src/components/FacultyManagementTable.tsx": "Renders a table of faculty members with inline name editing, active/inactive toggling, and deletion, using mutation hooks for each operation. Each row is a self-contained FacultyRow component managing its own edit and loading state.",
  "frontend/src/components/FacultyPDFList.tsx": "Fetches and displays a list of PDFs assigned to a specific faculty member as clickable cards that navigate to the teaching view. Shows loading, error, and empty states appropriately.",
  "frontend/src/components/FacultySelector.tsx": "Renders a centered card with a dropdown for selecting a faculty member from a list, then calls an onSelect callback to proceed. Handles loading and empty-list states.",
  "frontend/src/components/Layout.tsx": "Provides the app shell with a sticky header containing navigation links to Admin, Faculty, and Dev Portal routes, plus a lock button for the admin panel and a PWA install prompt. Conditionally shows the Dev Portal link and lock button based on admin status and current route.",
  "frontend/src/components/PDFListTable.tsx": "Renders a table displaying uploaded PDFs with their title, assigned faculty names, upload date, and taught/untaught status. Shows an empty state when no PDFs exist.",
  "frontend/src/components/PDFUploadForm.tsx": "Form component for uploading a PDF with a title, file selection, and faculty assignment. Reads the file as base64 and calls the uploadPDF mutation, handling subscription limit errors.",
  "frontend/src/components/SubscriptionSection.tsx": "Displays subscription plan tiers (basic, premium, diamond) with usage progress bars for faculty and PDFs, billing cycle selection, and plan upgrade actions.",
  "frontend/src/context/FacultyContext.tsx": "React context that stores and exposes the currently selected faculty member's ID and name, with setter and clear functions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDeviceRegistration.ts": "Hook that manages device registration status with a safety timeout fallback; currently bypasses backend registration and immediately sets status to 'allowed'.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, wrapping DFINITY's AuthClient to expose login, logout, identity, and login status to React components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating faculty, PDFs, annotations, devices, and admin state via the backend actor. Also exports subscription plan tier definitions and billing cycle constants.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind, and defines CSS custom properties for a light/dark academic color palette using OKLCH values, plus utility classes for touch targets and annotation canvas.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page protected by a passcode gate, allowing admins to manage faculty, upload PDFs, view subscription info, and manage devices, with inline error handling for plan limits.",
  "frontend/src/pages/DeveloperPortal.tsx": "Developer/debug portal page displaying tabbed views of system stats, faculty with PDF counts, devices, annotations, and subscription plan details, accessible only to admins.",
  "frontend/src/pages/FacultyPortal.tsx": "Faculty portal page that shows a faculty selector when no faculty is chosen, then displays the selected faculty's assigned PDF list with options to switch faculty or navigate to the developer portal.",
  "frontend/src/pages/HomePage.tsx": "Landing page with a hero section, navigation buttons to Admin Panel and Faculty Portal, a feature highlights grid, and a notice displaying default admin login credentials.",
  "frontend/src/pages/TeachingView.tsx": "Full-screen teaching view page that renders a PDF (converted from base64 to blob URL) with an annotation canvas overlay, supporting freehand draw/highlight/text tools with debounced auto-save and a mark-as-taught action.",
  "frontend/src/utils/deviceFingerprint.ts": "Generates and caches a stable device fingerprint by combining browser/device characteristics (user agent, screen, canvas hash) with a persisted UUID stored in localStorage.",
  "frontend/src/utils/pwa.ts": "Provides a React hook for PWA install prompt handling and a utility function to register the service worker for offline/installable app support.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both regular and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, OKLCH-based semantic color tokens, border radii, box shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest (version 37) describing the smart board app's features, architectural notes, known issues, and existing feature list for admin PDF management, faculty portal, teaching view, and device licensing."
}