{
  "kind": "build_request",
  "title": "Update subscription plan pricing, limits, and license counts",
  "projectName": "EduBoard",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-56",
      "text": "Update the backend subscription plan data model in `backend/main.mo` to reflect the following exact pricing and limits for all three tiers and four billing cycles. Basic: 30 faculty, 500 PDFs, 2 licenses — Monthly ₹8,000, Quarterly ₹25,000, Half-yearly ₹50,000, Yearly ₹1,00,000. Premium: 100 faculty, 2000 PDFs, 4 licenses — Monthly ₹16,500, Quarterly ₹50,000, Half-yearly ₹1,00,000, Yearly ₹2,00,000. Diamond: 500 faculty, 5000 PDFs, 6 licenses — Monthly ₹33,000, Quarterly ₹1,00,000, Half-yearly ₹2,00,000, Yearly ₹4,00,000. Each plan variant must store: tier name, billing cycle label, faculty limit, PDF limit, license count, and price in INR. Ensure the default plan (used on first deploy or when no plan has been explicitly selected) is set to Basic Monthly with its correct limits.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "basic 30 faculty 500 pdf  8000 inr Monthly",
          "Premium 100 faculty 2000 pdf  16500 inr Monthly",
          "Diamond 500 faculty 5000 pdf  33000 inr Monthly",
          "Basic Plan will have 2 Licenses",
          "premium will have 4 Licenses",
          "diamond will have 6 Licenses"
        ]
      },
      "acceptanceCriteria": [
        "Basic tier stores facultyLimit=30, pdfLimit=500, licenseCount=2 for all billing cycles",
        "Premium tier stores facultyLimit=100, pdfLimit=2000, licenseCount=4 for all billing cycles",
        "Diamond tier stores facultyLimit=500, pdfLimit=5000, licenseCount=6 for all billing cycles",
        "Basic Monthly price is 8000 INR, Quarterly 25000, Half-yearly 50000, Yearly 100000",
        "Premium Monthly price is 16500 INR, Quarterly 50000, Half-yearly 100000, Yearly 200000",
        "Diamond Monthly price is 33000 INR, Quarterly 100000, Half-yearly 200000, Yearly 400000",
        "Default plan on first deploy is Basic Monthly with correct non-zero limits",
        "No Free tier exists in the backend plan data model"
      ]
    },
    {
      "id": "REQ-57",
      "text": "Update the plan tier configuration object in `frontend/src/hooks/useQueries.ts` (and any other frontend location where plan data is hardcoded, such as `frontend/src/components/SubscriptionSection.tsx`) to match the updated pricing, limits, and license counts exactly: Basic (30 faculty, 500 PDFs, 2 licenses), Premium (100 faculty, 2000 PDFs, 4 licenses), Diamond (500 faculty, 5000 PDFs, 6 licenses), with all four billing cycle prices as specified. Each plan card in the Subscription Management section must display the license count (e.g., '2 Licenses') alongside the faculty limit, PDF limit, and price.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "basic 30 faculty 500 pdf  8000 inr Monthly",
          "Diamond 500 faculty 5000 pdf  400000 inr  yearly",
          "Basic Plan will have 2 Licenses",
          "premium will have 4 Licenses",
          "diamond will have 6 Licenses"
        ]
      },
      "acceptanceCriteria": [
        "SubscriptionSection displays three plan cards: Basic, Premium, Diamond — no Free plan card",
        "Each card shows the correct faculty limit, PDF limit, license count, and per-cycle price",
        "Basic card shows: 30 Faculty, 500 PDFs, 2 Licenses, with prices 8000/25000/50000/100000 INR per cycle",
        "Premium card shows: 100 Faculty, 2000 PDFs, 4 Licenses, with prices 16500/50000/100000/200000 INR per cycle",
        "Diamond card shows: 500 Faculty, 5000 PDFs, 6 Licenses, with prices 33000/100000/200000/400000 INR per cycle",
        "Billing cycle selector on each card updates the displayed price correctly",
        "Selecting a plan passes the correct tier and billing cycle to the backend updatePlan call",
        "The plan tier configuration in useQueries.ts matches these exact values"
      ]
    }
  ],
  "constraints": [
    "Do not remove or alter the billing cycle selector (Monthly, Quarterly, Half-yearly, Yearly) on plan cards",
    "Do not change any other part of the Admin Panel beyond the subscription plan data",
    "Preserve all existing backend functions and their signatures; only update plan data constants/initialization",
    "The Free plan must not reappear anywhere in backend or frontend"
  ],
  "nonGoals": [
    "Changing the visual layout or styling of the Subscription Management section",
    "Adding payment processing or external billing integrations",
    "Modifying faculty management, PDF upload, device management, or any other Admin Panel section",
    "Changing authentication flows or admin credential logic"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}