{
  "kind": "build_request",
  "title": "Fix PDF-to-faculty assignment in Admin Panel",
  "projectName": "EduBoard",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-51",
      "text": "Diagnose and fix the PDF upload/assignment flow in the Admin Panel so that admins can successfully assign a PDF to one or more faculty members. Audit the `PDFUploadForm` component (`frontend/src/components/PDFUploadForm.tsx`) and the `useUploadPDF` mutation hook in `frontend/src/hooks/useQueries.ts` to identify why the assignment fails: (1) verify the faculty selector inside the form correctly populates the list of active faculty members from the backend; (2) ensure the selected faculty IDs are collected and passed correctly to the backend `uploadPDF` call; (3) ensure no pre-flight admin credential re-check short-circuits the submission before the backend is contacted; (4) ensure the backend `uploadPDF` function in `backend/main.mo` accepts the faculty assignment parameter and persists the assignment without requiring a secondary authorization token — the sessionStorage flag set by AdminPasscodeGate is the sole auth signal; (5) after a successful upload, invalidate and refetch the PDF list query so the table reflects the newly assigned PDF immediately.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "im not able to assign pdf to faculty"
        ]
      },
      "acceptanceCriteria": [
        "The PDF upload form in the Admin Panel displays a populated list of active faculty members to assign to.",
        "Selecting one or more faculty members and submitting the form successfully calls the backend uploadPDF function with the selected faculty IDs.",
        "No admin credential prompt or authorization error appears when the user is already authenticated via AdminPasscodeGate.",
        "The backend uploadPDF function persists the faculty assignment without requiring any additional credential token from the frontend.",
        "After a successful upload, the PDF list table refreshes and shows the new PDF with the correct assigned faculty names.",
        "If the PDF upload or faculty assignment fails, a descriptive error message is shown inline in the form."
      ]
    },
    {
      "id": "REQ-52",
      "text": "Audit the backend `uploadPDF` function in `backend/main.mo` to ensure it does not enforce any caller-identity or admin-only access control check that would reject the call when invoked from the already-authenticated Admin Panel session. The function must accept a PDF title, base64 content, and an array of faculty IDs, store the PDF record with the faculty assignment, and return a well-typed success or error variant. Remove or disable any `assert`, `isAdmin` check, or caller-principal guard that causes it to return an authorization error.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "im not able to assign pdf to faculty"
        ]
      },
      "acceptanceCriteria": [
        "The backend uploadPDF function does not contain any caller-principal assertion or isAdmin guard that rejects the call.",
        "Calling uploadPDF with a valid title, base64 PDF content, and a non-empty array of faculty IDs returns a success variant.",
        "The stored PDF record includes the assigned faculty IDs and is retrievable via the getPDFsByFaculty and getAllPDFs functions.",
        "The function returns a descriptive error variant only for genuine failures such as plan PDF limit exceeded, not for authorization reasons."
      ]
    },
    {
      "id": "REQ-53",
      "text": "Update the `PDFUploadForm` component (`frontend/src/components/PDFUploadForm.tsx`) so that: (1) the faculty multi-select field fetches and renders the current list of active faculty members from the backend on mount; (2) the user can select one or more faculty members before submitting; (3) the `useUploadPDF` mutation in `frontend/src/hooks/useQueries.ts` calls `actor.uploadPDF(title, base64Content, selectedFacultyIds)` without any additional admin credential argument; (4) on success, the PDF list query is invalidated and refetched; (5) on failure, the specific error returned by the backend (e.g., PDF limit exceeded) is shown inline in the form.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "im not able to assign pdf to faculty"
        ]
      },
      "acceptanceCriteria": [
        "The faculty selector in PDFUploadForm shows all active faculty members fetched from the backend.",
        "At least one faculty member must be selected before the form allows submission.",
        "The mutation calls actor.uploadPDF with title, base64 content, and the array of selected faculty IDs — no admin token argument.",
        "On successful submission, the PDF list table is automatically refreshed.",
        "Error messages from the backend (e.g., PDF limit reached) are displayed inline without crashing the form."
      ]
    }
  ],
  "constraints": [
    "Do not re-introduce any secondary admin credential check inside PDFUploadForm, useUploadPDF, or the backend uploadPDF function.",
    "The sessionStorage flag set by AdminPasscodeGate remains the sole source of truth for admin authentication within the session.",
    "Do not modify files under frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts, frontend/src/main.tsx, or frontend/src/components/ui."
  ],
  "nonGoals": [
    "Changing the PDF data model or annotation system.",
    "Altering the subscription plan enforcement logic beyond what is needed to unblock PDF upload.",
    "Modifying the faculty creation flow (already addressed in prior requirements)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}