{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix PDF-to-faculty assignment in Admin Panel",
  "requirements": [
    {
      "id": "REQ-51",
      "summary": "Diagnose and fix the PDF upload/assignment flow in the Admin Panel so that admins can successfully assign a PDF to one or more faculty members",
      "acceptanceCriteria": [
        "The PDF upload form in the Admin Panel displays a populated list of active faculty members to assign to.",
        "Selecting one or more faculty members and submitting the form successfully calls the backend uploadPDF function with the selected faculty IDs.",
        "No admin credential prompt or authorization error appears when the user is already authenticated via AdminPasscodeGate.",
        "The backend uploadPDF function persists the faculty assignment without requiring any additional credential token from the frontend.",
        "After a successful upload, the PDF list table refreshes and shows the new PDF with the correct assigned faculty names.",
        "If the PDF upload or faculty assignment fails, a descriptive error message is shown inline in the form."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PDFUploadForm.tsx",
          "operation": "modify",
          "description": "Update the PDFUploadForm component to fetch and display active faculty members in a multi-select field on mount. Ensure the faculty selector correctly populates from the backend query. Add validation to require at least one faculty member to be selected before submission. Update the form submission handler to collect selected faculty IDs and pass them to the useUploadPDF mutation without any additional admin credential argument. Display backend error messages (e.g., PDF limit exceeded) inline within the form. Remove any pre-flight admin credential re-check that might short-circuit the submission before contacting the backend."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the useUploadPDF mutation hook to accept title, base64Content, and selectedFacultyIds parameters. Ensure the mutation calls actor.uploadPDF(title, base64Content, selectedFacultyIds) without passing any additional admin token or credential argument. On successful upload, invalidate the PDF list query (['pdfs']) to trigger an immediate refetch so the table displays the newly assigned PDF. Ensure error responses from the backend are properly returned to the form for inline display."
        }
      ]
    },
    {
      "id": "REQ-53",
      "summary": "Update the PDFUploadForm component so that the faculty multi-select field fetches and renders active faculty members, allows selecting one or more faculty members, and calls the backend without any additional admin credential",
      "acceptanceCriteria": [
        "The faculty selector in PDFUploadForm shows all active faculty members fetched from the backend.",
        "At least one faculty member must be selected before the form allows submission.",
        "The mutation calls actor.uploadPDF with title, base64 content, and the array of selected faculty IDs — no admin token argument.",
        "On successful submission, the PDF list table is automatically refreshed.",
        "Error messages from the backend (e.g., PDF limit reached) are displayed inline without crashing the form."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PDFUploadForm.tsx",
          "operation": "modify",
          "description": "Refactor the PDFUploadForm component to include a faculty multi-select field that fetches the list of active faculty members from the backend on component mount using the useFaculty query. Render each active faculty member as a selectable option with their name displayed. Implement form state to track the array of selected faculty IDs. Add validation logic to ensure at least one faculty member is selected before enabling form submission. Update the form submit handler to pass the title, base64 PDF content, and selectedFacultyIds array to the useUploadPDF mutation. Display any error returned by the mutation inline within the form (e.g., using an error message element below the submit button). Ensure no admin credential re-check occurs within the form before calling the mutation."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Modify the useUploadPDF mutation to accept three parameters: title (string), base64Content (string), and selectedFacultyIds (array of bigint or number). Update the mutationFn to call actor.uploadPDF(title, base64Content, selectedFacultyIds) without passing any admin token or additional credential argument. Configure the mutation's onSuccess callback to invalidate the ['pdfs'] query key using queryClient.invalidateQueries so the PDF list table automatically refetches and displays the newly uploaded PDF with its assigned faculty. Ensure the mutation properly handles and returns backend error responses (such as PDF limit exceeded) so they can be displayed inline in the form."
        }
      ]
    }
  ]
}