{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update subscription plan pricing, limits, and license counts",
  "requirements": [
    {
      "id": "REQ-57",
      "summary": "Update frontend subscription plan configuration to reflect new pricing, limits, and license counts for all three tiers (Basic, Premium, Diamond) across all four billing cycles, and display license counts on plan cards",
      "acceptanceCriteria": [
        "SubscriptionSection displays three plan cards: Basic, Premium, Diamond — no Free plan card",
        "Each card shows the correct faculty limit, PDF limit, license count, and per-cycle price",
        "Basic card shows: 30 Faculty, 500 PDFs, 2 Licenses, with prices 8000/25000/50000/100000 INR per cycle",
        "Premium card shows: 100 Faculty, 2000 PDFs, 4 Licenses, with prices 16500/50000/100000/200000 INR per cycle",
        "Diamond card shows: 500 Faculty, 5000 PDFs, 6 Licenses, with prices 33000/100000/200000/400000 INR per cycle",
        "Billing cycle selector on each card updates the displayed price correctly",
        "Selecting a plan passes the correct tier and billing cycle to the backend updatePlan call",
        "The plan tier configuration in useQueries.ts matches these exact values"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the PLAN_TIERS constant object to reflect the new pricing structure, limits, and license counts. Set Basic tier to facultyLimit=30, pdfLimit=500, licenseCount=2 with prices monthly=8000, quarterly=25000, halfYearly=50000, yearly=100000. Set Premium tier to facultyLimit=100, pdfLimit=2000, licenseCount=4 with prices monthly=16500, quarterly=50000, halfYearly=100000, yearly=200000. Set Diamond tier to facultyLimit=500, pdfLimit=5000, licenseCount=6 with prices monthly=33000, quarterly=100000, halfYearly=200000, yearly=400000. Remove any Free tier if present. Ensure the PlanTier type and all related interfaces include the licenseCount field."
        },
        {
          "path": "frontend/src/components/SubscriptionSection.tsx",
          "operation": "modify",
          "description": "Update the component to display the license count for each plan card alongside the faculty limit and PDF limit. Ensure each plan card shows '2 Licenses' for Basic, '4 Licenses' for Premium, and '6 Licenses' for Diamond. Verify that the billing cycle selector correctly updates the displayed price for all four cycles (Monthly, Quarterly, Half-yearly, Yearly) using the updated PLAN_TIERS data from useQueries.ts. Ensure only three plan cards (Basic, Premium, Diamond) are rendered and that no Free plan card appears. Confirm that the plan selection logic passes the correct tier and billing cycle to the backend setSubscriptionPlan call."
        }
      ]
    }
  ]
}